name: "qwen35_llm"
backend: "vllm"
max_batch_size: 0  

model_transaction_policy {
  decoupled: true
}

input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [-1]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]
  }
]

# vLLM engine params (gpu_memory_utilization, quantization, ...) đặt trong 1/model.json